import React from 'react'
import './styles.css'

export default function ConditionsComponent() {

    return (
        <React.Fragment>

            <div className={"text"} >

                <h1>Пользовательское Соглашение</h1>
                <ul>
                    <li>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ООО "Корпорация Джей Эс" (далее HELI или Администрация) с одной стороны и пользователем сайта с другой.</li>
                    <li>Сайт HELI не является средством массовой информации.</li>
                    <li>Используя сайт, Вы соглашаетесь с условиями данного соглашения.
                        Если Вы не согласны с условиями данного соглашения, не используйте сайт HELI!
                    </li>
                    <li>Права и обязанности сторон</li>
                    <li>Пользователь имеет право:</li>

                    <li>
                        <ul>
                            <li>- осуществлять поиск информации на сайте</li>
                            <li> - получать информацию на сайте</li>
                            <li> - копировать информацию на другие сайты с указанием источника</li>
                            <li>- использовать информацию сайта в личных некоммерческих целях</li>
                        </ul>
                    </li>



                    <li>Администрация имеет право:</li>
                    <ul>
                        <li>- по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
                        <li>- ограничивать доступ к любой информации на сайте</li>
                        <li>- создавать, изменять, удалять информацию</li>
                        <li>- удалять учетные записи</li>
                        <li>- отказывать в регистрации без объяснения причин</li>
                    </ul>
                    <li>Пользователь обязуется:</li>
                        <ul>
                            <li>- обеспечить достоверность предоставляемой информации</li>
                            <li>- обеспечивать сохранность личных данных от доступа третьих лиц</li>
                            <li>- обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</li>
                            <li>- не нарушать работоспособность сайта</li>
                            <li>- не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</li>
                            <li>- не совершать действия, направленные на введение других Пользователей в заблуждение</li>
                            <li>- не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
                            <li>- не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</li>
                            <li>- не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
                            <li>- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
                        </ul>
                    <li>Администрация обязуется:</li>
                        <ul>
                            <li>- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
                            <li>- осуществлять разностороннюю защиту учетной записи Пользователя</li>
                            <li>- защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
                            <li>- предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
                        </ul>
                    <li>Ответственность сторон</li>
                        <ul>
                            <li>- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
                            <li>- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
                        </ul>
                    <li>Условия действия Соглашения</li>
                    <li>Данное Соглашение вступает в силу при регистрации на сайте.</li>
                    <li>Соглашение перестает действовать при появлении его новой версии.</li>
                    <li>Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</li>
                    <li>При любом изменении данного соглашения, администрация будет оповещать пользователей удобным для нее способом.</li>
                </ul>
            </div>
        </React.Fragment>
    )
}